README.md
```mermaid
erDiagram
    USER ||--o{ PROJECT : "manager"
    USER ||--o{ TASK : "assigned_to"
    PROJECT ||--o{ TASK : "contains"

    USER {
      Long id
      String name
      String email
      String password
      Role role
      LocalDateTime createdAt
      LocalDateTime deletedAt
    }

    PROJECT {
      Long id
      String name
      String description
      LocalDateTime createdAt
      LocalDateTime deletedAt
    }

    TASK {
      Long id
      String title
      String description
      String status
      LocalDateTime createdAt
      LocalDateTime deletedAt
    }
```
